#include <iostream>
using namespace std;

int main () {
  /// Създаваме променливи за брой монети и за бр.преправяния
  long long n, m;

  /// Прочитаме данни за броя монети и бр. преправяния
  cin >> n >> m;

  /// Създаваме масив, който ще имитира редицата с монети
  long long A[n];

  /// Всички монети в масива зареждаме със стойност,
  /// означаваща положение "ези"
  long long i=0;
  while (i<n) {
    A[i]=0;      /// 0 = ези, 20 = тура
    i=i+1;
  }
  /// В цикъл правим отделните преправяния
  long long j=0, startpos, count_coints;
  while (j<m) {

      /// Четем данни за начална монета на преправянето и
      /// за брой монети, участващи в преправянето
      cin >> startpos >> count_coints;

      /// Преобръщаме монетите (отново в цикъл)
      i = startpos-1;
      while (i<startpos+count_coints-1) {
        A[i]=(20+0) - A[i];
        i=i+1;
      }
      j=j+1;
  }
  /// Преброяваме колко от монетите са в положение "тура"
  /// (отново в цикъл :-) )
  i=0;
  long long suma=0;
  while (i<n) {
    suma=suma+A[i];
    i=i+1;
  }
  /// печатим suma
  cout << suma << endl;
  return 0;
}
